{
    "grant_id": 1001,
    "source_id": 2,
    "crawled_date": "2025-04-03 13:22:01",
    "title": "Kindred Cares Grant",
    "description": "The Kindred Cares Grant provides funding for programs, projects, operations and research in the area of hospice, palliative, and end-of-life care for children and adults with life-limiting conditions and their families.",
    "funding_agency": "Kindred Foundation",
    "amount": 10000.0,
    "deadline": null,
    "eligibility_criteria": "The applying organization must be a Canadian registered charity or have a partnership with a Canadian registered charity that can accept funds for the applying organization.Pediatric Palliative Care across CanadaPrograms, projects and/or operations aiming to improve the quality of life for children with life-limiting conditions and/or their families. No restrictions on the organizational budget.Research in Canada on pediatric palliative care affiliated with an academic health science centre or university. Early career researchers and health professionals are encouraged to apply. No restrictions on the organizational budget.Adult Palliative Care in OntarioPrograms, projects and/or operations aiming to improve the quality of life for adults with life-limiting conditions and/or their families. The organizational budget must be under $5 MM.Research in Ontario on adult palliative care affiliated with an academic health science centre or university. Early career researchers and health professionals are encouraged to apply. No restrictions on the organizational budget.Organizations that applied and/or received funding in previous years can re-apply if eligible.    Ineligible Expenses Include:For programs, projects and research, administrative costs should not exceed 15% (not including staffing costs)Membership, registration and conference feesTravel, tuition, books, journals, and publication costsFundraising activitiesOverall Information$50,000 in total funding is available; a maximum of $10,000 per grant.Competitive peer-reviewed review process.The Grant accepts applications around the fourth quarter on a yearly basis, with funding allocated to awarded applications in December.Straight-forward gift agreements are signed with each awardee, who is required to provide an end-of-year report on how the funds were spent, learnings, and successes.Individualized feedback is provided to each applicant that does not receive funding.It is possible that the provincial focus for adult palliative care may change in future years.Important DatesSeptember 16, 2024:  Application window opensOctober 28, 2024 at 5pm ET: Application window closesEnd of November 2024:  Communication to applicantsPlease contact us if you have any questions.Copyright 2025 Kindred FoundationWho We Areabout usour missionour impactour teamboard of directorspartners and sponsorsreportsnewsChildhood CancerTreats & Treasures CartU-Link Patient and Family FundFamily Support Packagesfunding childhood cancerabout childhood cancerabout clinical trialsmental health and cancerYouth Mental and Physical HealthYouth Mental Health Grantscholarshipsyouth living with physical disabilitiesyouth mental healthyouth physical healthCommunity Supportour communitiesKindred Cares GrantKindred CommitteesPhoebe Rose Rocks CommitteeEli's CommitteeHunter's CommitteeTillsonburg Running With the BulllsCHARITY REGISTRATION #798799078 RR0001Follow us on Instagram  and LinkedInJoin Our Kindred Spirit Mailing ListGoogle SitesReport abuseGoogle SitesReport abuse",
    "application_url": "https://www.kindredfoundation.ca/community-support/kindred-cares-grant",
    "last_updated": "2025-04-03 13:22:01",
    "is_active": false,
    "assignee": ""
}