[
    {
        "grant_id": 1,
        "source_id": 1,
        "crawled_date": "2025-04-21 17:14:57",
        "title": "Call for proposals for projects aimed at preventing and addressing child maltreatment",
        "description": "Child maltreatment is a serious and prevalent public health issue, with both immediate and long-term health and social impacts that affect children, families, and communities across Canada. Child maltreatment is also a risk factor for violence in relationships later in life. Preventing child maltreatment and its health impacts is a crucial measure to enable physical, mental, social and spiritual wellbeing throughout the life course.\nThe Public Health Agency of Canada (PHAC) supports health promotion interventions to prevent and address child maltreatment and its impacts. These can include, for example, interventions that:\nbuild skills and knowledge for safe and healthy relationships\nidentify and address factors that put families and children at risk of child maltreatment\naddress community and societal-level factors to prevent child maltreatment\nequip service providers with evidence-based training and resources to help prevent child maltreatment and its health impacts",
        "funding_agency": "Public Health Agency of Canada",
        "amount": 1500000.0,
        "deadline": "2025-05-28",
        "eligibility_criteria": "Eligible applicants include:\nCanadian not-for-profit organizations\nCanadian organizations and institutions supported primarily by provincial and territorial governments (regional health authorities, schools, post-secondary institutions, etc.)\nCanadian research organizations or academic institutions\nIndigenous governments and Indigenous not-for-profit organizations\nApplicants and collaborators must have the necessary experience and knowledge to deliver the project. Together, applicants must demonstrate the following:\nExpertise in intervention research\nExperience working on child maltreatment issues and\nOrganizational and operational capacity to manage the proposed project activities and budget",
        "application_url": "https://www.canada.ca/en/public-health/services/funding-opportunities/grant-contribution-funding-opportunities/call-proposals-projects-aimed-preventing-addressing-child-maltreatment.html",
        "last_updated": "2025-04-21 17:14:57",
        "is_active": true,
        "assignee": ""
    },
    {
        "grant_id": 1001,
        "source_id": 2,
        "crawled_date": "2025-04-21 17:15:02",
        "title": "Kindred Cares Grant",
        "description": "The Kindred Cares Grant provides funding for programs, projects, operations and research in the area of hospice, palliative, and end-of-life care for children and adults with life-limiting conditions and their families.",
        "funding_agency": "Kindred Foundation",
        "amount": 10000.0,
        "deadline": null,
        "eligibility_criteria": "The applying organization must be a Canadian registered charity or have a partnership with a Canadian registered charity that can accept funds for the applying organization.Pediatric Palliative Care across CanadaPrograms, projects and/or operations aiming to improve the quality of life for children with life-limiting conditions and/or their families. No restrictions on the organizational budget.Research in Canada on pediatric palliative care affiliated with an academic health science centre or university. Early career researchers and health professionals are encouraged to apply. No restrictions on the organizational budget.Adult Palliative Care in OntarioPrograms, projects and/or operations aiming to improve the quality of life for adults with life-limiting conditions and/or their families. The organizational budget must be under $5 MM.Research in Ontario on adult palliative care affiliated with an academic health science centre or university. Early career researchers and health professionals are encouraged to apply. No restrictions on the organizational budget.Organizations that applied and/or received funding in previous years can re-apply if eligible.    Ineligible Expenses Include:For programs, projects and research, administrative costs should not exceed 15% (not including staffing costs)Membership, registration and conference feesTravel, tuition, books, journals, and publication costsFundraising activitiesOverall Information$50,000 in total funding is available; a maximum of $10,000 per grant.Competitive peer-reviewed review process.The Grant accepts applications around the fourth quarter on a yearly basis, with funding allocated to awarded applications in December.Straight-forward gift agreements are signed with each awardee, who is required to provide an end-of-year report on how the funds were spent, learnings, and successes.Individualized feedback is provided to each applicant that does not receive funding.It is possible that the provincial focus for adult palliative care may change in future years.Important DatesSeptember 16, 2024:  Application window opensOctober 28, 2024 at 5pm ET: Application window closesEnd of November 2024:  Communication to applicantsPlease contact us if you have any questions.Copyright 2025 Kindred FoundationWho We Areabout usour missionour impactour teamboard of directorspartners and sponsorsreportsnewsChildhood CancerTreats & Treasures CartU-Link Patient and Family FundFamily Support Packagesfunding childhood cancerabout childhood cancerabout clinical trialsmental health and cancerYouth Mental and Physical HealthYouth Mental Health Grantscholarshipsyouth living with physical disabilitiesyouth mental healthyouth physical healthCommunity Supportour communitiesKindred Cares GrantKindred CommitteesPhoebe Rose Rocks CommitteeEli's CommitteeHunter's CommitteeFinn's CommitteeAndrew and Christopher's CommitteeTeam SyrenTillsonburg Running With the BulllsCHARITY REGISTRATION #798799078 RR0001Follow us on Instagram  and LinkedInJoin Our Kindred Spirit Mailing ListGoogle SitesReport abuseGoogle SitesReport abuse",
        "application_url": "https://www.kindredfoundation.ca/community-support/kindred-cares-grant",
        "last_updated": "2025-04-21 17:15:02",
        "is_active": false,
        "assignee": ""
    },
    {
        "grant_id": 2001,
        "source_id": 3,
        "crawled_date": "2025-04-21 17:15:08",
        "title": "Seed Grant",
        "description": "Seed grants help organizations build resilience and enhance their ability to deliver programs and services that directly benefit community members. Applicants can apply for funding to support organizational planning, pilot a new program, and build their capacity to plan for future programs and services.",
        "funding_agency": "Ontario Trillium Foundation",
        "amount": 10000.0,
        "deadline": "2025-08-20",
        "eligibility_criteria": "Interested applicants must:\n• deliver programs and services in one of four sectors: sports and recreation, arts and culture, environment, and human and social services.\n• have a primary purpose, presence, and reputation for delivering community-based programs and services with direct community benefit in one of OTF’s 16 geographic catchment areas in Ontario.\n• demonstrate the financial and organizational capacity to manage OTF funds, and deliver and complete the proposed project as per OTF’s Financial Need and Health of Applicants policy.\n• demonstrate that it is the appropriate organization or community to carry out the proposed project.\n\nApplicants must be one of the following:\n• Non-profit organizations\n• Indigenous communities\n• Municipalities, libraries and local services boards\n• Collaboratives\n• Religious entities\n",
        "application_url": "https://otf.ca/our-grants/community-investments-grants/seed-grant",
        "last_updated": "2025-04-21 17:15:08",
        "is_active": false,
        "assignee": ""
    },
    {
        "grant_id": 2002,
        "source_id": 3,
        "crawled_date": "2025-04-21 17:15:08",
        "title": "Grow Grant",
        "description": "Grow grants range from $100,000 to $600,000 over 2 or 3 years. Grants support established programs and services that have a proven track record of success and meet community need. Applicants can apply for funding to expand, improve or adapt an existing program or service.",
        "funding_agency": "Ontario Trillium Foundation",
        "amount": 50000.0,
        "deadline": "2025-11-05",
        "eligibility_criteria": "Interested applicants must:\n• deliver programs and services in one of four sectors: sports and recreation, arts and culture, environment, and human and social services.\n• have a primary purpose, presence, and reputation for delivering community-based programs and services with direct community benefit in one of OTF’s 16 geographic catchment areas in Ontario.\n• demonstrate the financial and organizational capacity to manage OTF funds, and deliver and complete the proposed project as per OTF’s Financial Need and Health of Applicants policy.\n• demonstrate that it is the appropriate organization or community to carry out the proposed project.\n\nApplicants must be one of the following:\n• Non-profit organizations\n• Indigenous communities\n• Municipalities, libraries and local services boards\n• Collaboratives\n• Religious entities\n",
        "application_url": "https://otf.ca/our-grants/community-investments-grants/grow-grant",
        "last_updated": "2025-04-21 17:15:08",
        "is_active": false,
        "assignee": ""
    }
]